[
{"title": "TikTok launches Search Guide in Nepal for sexual abuse awareness and help"},
{"title": "Honor 400 5G launched from Mt Everest"},
{"title": "Acer launches latest lineup of high-performance monitors in Nepal"},
{"title": "Nepal’s Mach24 Orbitals joins NVIDIA Inception Program, accelerating AI-driven rocket technology"},
{"title": "TikTok launches Family Pairing feature in Nepal to enhance teen safety"},
{"title": "Leapfrog Hackathon 2025 concludes"},
{"title": "Nepal’s Mach24 Orbital showcases space innovation at Startup Mahakumbh 2025"},
{"title": "Nepal imports nearly Rs 15 billion worth of EVs in 7 months"},
{"title": "Women in science: Here’s an inspiring bunch of 8 Nepali researchers"},
{"title": "Samsung Galaxy S25 and Galaxy S25+: A better alternative to flagship rivals?"},
{"title": "Samsung Galaxy S25 Ultra: Can AI completely transform the future of flagship smartphones?"},
{"title": "Nationwide internet outage in Nepal after payment dispute with Indian bandwidth provider"},
{"title": "Redmi Note 14 Pro+ 5G: Can this mid-range titan challenge flagships?"},
{"title": "Redmi Note 14 Pro 5G: Fresh new design and performance at a mid-range price"},
{"title": "Redmi Note 14 5G: The best budget 5G smartphone this year?"},
{"title": "Redmi Note 14 4G: An impressive upgrade or a notable downgrade to its predecessor?"},
{"title": "OnePlus 13: How will the Snapdragon 8 Elite redefine performance in this Flagship smartphone?"},
{"title": "OPPO Reno12 F 4G: Can the AI features truly elevate the mid-range experience?"},
{"title": "The Honey Browser Extension Scam: An urgent wake-up call for Nepali creators on brand deal pitfalls in 2025?"},
{"title": "Gearing up for WordCamp Nepal 2025"},
{"title": "Teej: You can eat these ‘pure’ food items on your fasting day in Nepal"},
{"title": "Teej fasting: Here are some pros and cons, as well as warnings, that you should know"},
{"title": "Pokhara-Australia flights to start soon"},
{"title": "Nishant Nair: Street View brings Nepal’s landscapes and heritage closer to the world"},
{"title": "Why Kathmandu needs more public spaces?"},
{"title": "Decades-old irrigation projects stall as Madhesh faces drought, food crisis looms"},
{"title": "Nepal’s farming crisis: When plans stay on paper and fields suffer"},
{"title": "Gunla: Month-long festival of devotion, music, and pilgrimage begins across the Valley"},
{"title": "Gathamuga: Interesting stories behind strange rituals of Kathmandu’s annual monsoon festival"},
{"title": "How Nepal is shifting justice in its approach to internal trafficking"},
{"title": "Embossed number plate installation expanded to 16 transport offices nationwide"},
{"title": "Nepal’s food bowl is drying up, and no one was listening"},
{"title": "The best method to learn? Mess up first"},
{"title": "All you need to know about the Miss Nepal 2025 winners"},
{"title": "Nepal redefines youth as ages 18–35 in new policy"}
]